update: add flowchart in readme
